## import data

In [1]:
import pandas as pd

In [5]:
#import babyNamesUS csv file data 
file = 'data/babyNamesUS.csv'
raw = pd.read_csv(file)

In [6]:
raw.head()

  StateCode Sex  YearOfBirth      Name  Number
0        AK   F         1910      Mary      14
1        AK   F         1910     Annie      12
2        AK   F         1910      Anna      10
3        AK   F         1910  Margaret       8
4        AK   F         1910     Helen       7

In [8]:
raw.info()
#info() : summary of dataframe
#total of 1048574 data 
#5 columns with 1048575 data respectively

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
StateCode      1048575 non-null object
Sex            1048575 non-null object
YearOfBirth    1048575 non-null int64
Name           1048575 non-null object
Number         1048575 non-null int64
dtypes: int64(2), object(3)
memory usage: 40.0+ MB

## pivot_table
pd.pivot_table(index = 'column', columns = 'column', values = 'column', `aggfunc` = 'sum') 
`aggfunc` options: sum, count, mean, ...

- Count Name frequency

In [10]:
raw.pivot_table(index = 'Name', values = 'Number', aggfunc='sum')

        Number
Name
Aadan       18
Aaden      855
Aadhav      14
Aadhya     188
Aadi       116
...        ...
Zylah       36
Zyler       38
Zyon        97
Zyra        23
Zyrah        5

[20815 rows x 1 columns]

- Count Name/Sex frequency

In [11]:
name_df = raw.pivot_table(index = 'Name', values = 'Number', columns = 'Sex', aggfunc='sum')
name_df.head()

Sex         F      M
Name
Aadan     NaN   18.0
Aaden     NaN  855.0
Aadhav    NaN   14.0
Aadhya  188.0    NaN
Aadi      NaN  116.0

In [12]:
name_df.info()
#sex/name data total: 20815 (existing value, excluding n/a)
#female: 14140
#male: 8658

<class 'pandas.core.frame.DataFrame'>
Index: 20815 entries, Aadan to Zyrah
Data columns (total 2 columns):
F    14140 non-null float64
M    8658 non-null float64
dtypes: float64(2)
memory usage: 487.9+ KB

## Fill N/A cell

In [13]:
name_df = name_df.fillna(0)
name_df.head()

Sex         F      M
Name
Aadan     0.0   18.0
Aaden     0.0  855.0
Aadhav    0.0   14.0
Aadhya  188.0    0.0
Aadi      0.0  116.0

In [14]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20815 entries, Aadan to Zyrah
Data columns (total 2 columns):
F    20815 non-null float64
M    20815 non-null float64
dtypes: float64(2)
memory usage: 487.9+ KB

## Sort

- name_df.sort_values(by = 'column', ascending = False)

In [23]:
#Find Top 5 Male names
#Find Top 5 Female names
name_df.sort_values(by = 'M').head()

Sex             F    M
Name
Kasandra   2130.0  0.0
Lillyanna   442.0  0.0
Lillyanne    48.0  0.0
Lillybeth     5.0  0.0
Lilou         5.0  0.0

In [28]:
name_df.sort_values(by = 'M', ascending = False).head().index

Index(['Michael', 'James', 'Robert', 'John', 'David'], dtype='object', name='Name')

In [29]:
name_df.sort_values(by = 'F', ascending = False).head().index

Index(['Mary', 'Jennifer', 'Elizabeth', 'Patricia', 'Linda'], dtype='object', name='Name')

## Explore other columns data

- df['column'].`unique()`

- df['column'].`value_counts()`

In [30]:
raw['StateCode'].unique()

array(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL'],
      dtype=object)

In [31]:
raw['StateCode'].value_counts()

CA    361128
AL    128556
AZ    108599
CO    101403
AR     97560
CT     78039
FL     61322
DC     53933
DE     30892
AK     27143
Name: StateCode, dtype: int64

In [32]:
raw['YearOfBirth'].value_counts()

2007    17166
2008    17109
2009    16914
2014    16820
2006    16810
        ...
1914     3997
1913     3417
1912     3148
1911     2392
1910     2358
Name: YearOfBirth, Length: 106, dtype: int64